---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryDirectionX
source: html/dcc670e5-da36-feb8-8de6-a6e55e76894f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryDirectionX Property

"X Translation"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryDirectionX { get; }
```